{
  "phases": [
    "MAIN_PHASE_1",
    "STANDBY_PHASE",
    "MAIN_PHASE_1",
    "MAIN_PHASE_1",
    "MAIN_PHASE_1",
    "MAIN_PHASE_1",
    "MAIN_PHASE_1",
    "MAIN_PHASE_1",
    "MAIN_PHASE_1",
    "MAIN_PHASE_1",
    "DRAW_PHASE",
    "STANDBY_PHASE",
    "MAIN_PHASE_1",
    "BATTLE_PHASE",
    "MAIN_PHASE_1",
    "END_PHASE",
    "STANDBY_PHASE",
    "MAIN_PHASE_1",
    "STANDBY_PHASE",
    "STANDBY_PHASE",
    "DRAW_PHASE",
    "DRAW_PHASE",
    "BATTLE_PHASE",
    "BATTLE_PHASE",
    "BATTLE_PHASE",
    "MAIN_PHASE_1",
    "MAIN_PHASE_1",
    "BATTLE_PHASE",
    "BATTLE_PHASE",
    "BATTLE_PHASE",
    "BATTLE_PHASE",
    "BATTLE_PHASE",
    "BATTLE_PHASE",
    "MAIN_PHASE_1",
    "MAIN_PHASE_1",
    "BATTLE_PHASE",
    "MAIN_PHASE_1",
    "MAIN_PHASE_1",
    "MAIN_PHASE_1",
    "BATTLE_PHASE",
    "END_PHASE",
    "END_PHASE",
    "END_PHASE"
  ],
  "summoning": {
    "normal": {
      "limit": 1,
      "requirements": {}
    },
    "tribute": {
      "requirements": {}
    }
  },
  "battle": {
    "steps": [
      "Battles and Chains",
      "l  Monster Battle Rules .............................................................. 41",
      "BATTLE WITH FANTASTIC MONSTERS & GREAT COMBOS",
      "monster’s battle position. (See page",
      "position your Monster Cards: face-up Attack Position,",
      "Place the card upright for Attack Position, and sideways",
      "ATK (Attack Points)",
      "ATK (Attack Points) / DEF (Defense Points)",
      "ATK is a monster’s Attack Points and DEF is a monster’s Defense",
      "Points. High Attack and Defense Points are good when battling!",
      "Monster Cards are used to battle and defeat your opponent. Battles",
      "simple slugfest, so monsters with high Attack and Defense Points will",
      "Attack Points and Defense",
      "an attack.",
      "When this card is destroyed by battle and sent to the",
      "attacked while face-down, or flipped face-up by a card effect.",
      "a monster they control so you can’t attack directly. You have to",
      "battle and destroy all their monsters first, including the one in the",
      "attack or defend, or you can",
      "Extra Monster Zone in face-up Attack or Defense",
      "play it in the Extra Monster Zone in face-up Attack or Defense",
      "high Attack Points as well. Since",
      "in either face-up Attack or Defense Position.",
      "Zone in either face-up Attack or Defense Position.",
      "a Monster Card from your hand onto the field in face-up Attack",
      "up Attack Position, without using a card effect. This is called a Flip",
      "face-up Defense Position, only to face-up Attack Position. A Monster",
      "choice of face-up Attack Position or face-up Defense Position.",
      "attack or card effect. Remember, you can only Normal Summon",
      "that slowly damage your opponent’s LP.",
      "by disrupting their attacks and",
      "Battle Phase",
      "If no battles are conducted",
      "Now it’s time to battle with your Monster Cards! This phase is divided",
      "You do not have to conduct a Battle Phase every turn, even if you",
      "Battle Phase on their first turn.",
      "of a face-up monster to face-up Attack or Defense Position. You",
      "three cases.  1. You cannot change the battle position of a monster",
      "in Main Phase 2 if the monster attacked during the Battle Phase.",
      "3. You cannot change it if you have already changed its battle",
      "Change Your Monsters’ Battle Positions",
      "Battle with monsters",
      "Battle Step",
      "Damage Step",
      "The Battle Phase is split into",
      "Battle Step and Damage Step are",
      "repeated each time you attack",
      "Set, or change the battle position of a monster, activate a card’s",
      "attacking monster and the attack",
      "target monster during a Battle",
      "Step, the attack target might be",
      "the Damage Step, due to a card’s",
      "to attack with the same monster",
      "again, or choose to attack with a",
      "to attack at all. Note that if you",
      "attack with a different monster,",
      "to have declared an attack, and it",
      "cannot attack again this turn.",
      "Replay Rules during the Battle Step",
      "This step starts the Battle Phase. The turn player should",
      "announce “I’m entering the Battle Phase.” Remember, the player",
      "who goes first cannot conduct a Battle Phase in their very first",
      "Select 1 monster on your side of the field to attack with, and 1 of",
      "your opponent’s monsters as your attack target, and then declare",
      "the attack. If your opponent does not have any monsters on the",
      "field, you can attack directly. Play then proceeds to the Damage",
      "Step. Afterwards, the attacking player returns to the Battle Step,",
      "and repeats this procedure. Each face-up Attack Position monster",
      "you control is allowed 1 attack per turn. You do not have to attack",
      "In this step, the players calculate the result of the battle and",
      "whatever damage is done. (See “Monster Battle Rules”, page 37.)",
      "After finishing the Damage Step, return to the Battle Step.",
      "After you’ve resolved all your battles by repeating the Battle and",
      "Damage Steps, and you have no more monsters you want to attack",
      "with, announce to your opponent that you are ending your Battle",
      "Declare your attacking",
      "monster and your attack",
      "before the Damage",
      "Monster Battle Rules",
      "If you conducted your Battle Phase, your turn moves to Main Phase 2",
      "in Main Phase 1) based on your situation after the Battle Phase. Use this",
      "Change your monsters’ battle positions",
      "DAMAGE STEP RULES",
      "During the Damage Step, you can only activate Counter Trap Cards,",
      "Also, these cards can only be activated up until the start of damage",
      "If you attack a face-down Defense Position monster, flip the card to",
      "face-up Defense Position in the Damage Step. Now you can see the",
      "monster’s DEF and then calculate damage.",
      "Attacking a Face-Down Card",
      "When an attacked monster is flipped face-up, any Flip effects are",
      "activated and resolved after damage calculation. If you need to select",
      "that has already been destroyed during damage calculation.",
      "During the Damage Step, there are limits on what cards you can",
      "activate. Also, during the Damage Step, Flip effects resolve a bit",
      "For more info on the Damage Step, please visit:",
      "www.yugioh-card.com/en/gameplay/damage_step/",
      "You calculate battle damage based on the battle position of the",
      "monster you are attacking. If you attack an Attack Position monster,",
      "compare ATK vs. ATK. If you attack a Defense Position monster,",
      "compare your monster’s ATK vs. the attacked monster’s DEF.",
      "When your attacking monster’s ATK is higher than the ATK of",
      "the opponent’s monster, the attacking monster destroys the",
      "The amount that your attacking monster’s ATK exceeds the",
      "opponent’s LP as battle damage.",
      "When your attacking monster’s ATK is equal to the ATK of the",
      "Neither player takes any battle damage.",
      "When your attacking monster’s ATK is lower than the ATK of",
      "the opponent’s monster, the attacking monster is destroyed",
      "ATK of your attacking monster is subtracted from your LP as",
      "battle damage.",
      "When your attacking monster’s ATK is higher than the DEF of",
      "When your attacking monster’s ATK is equal to the DEF of the",
      "When your attacking monster’s ATK is lower than the DEF of",
      "can attack directly. The full amount of your attacking monster’s ATK",
      "is subtracted from the opponent’s LP as battle damage.",
      "When You Attack an Attack Position Monster",
      "ATK of Attacking",
      "DETERMINING DAMAGE",
      "When You Attack a Defense Position Monster",
      "Prevents the opponent from declaring attacks this turn.",
      "player will still be able to declare attacks.",
      "allowing the turn player to attack without interference from Spell",
      "as it can indicate Attack Position or Defense",
      "of your 5 Monster Zones. Their battle position",
      "is always either face-up Attack Position or face-",
      "Monsters with 0 ATK cannot destroy anything by battle. If two Attack",
      "Position monsters with 0 ATK battle each other, neither monster is",
      "card effect takes precedence. For example, a monster can only attack",
      "once per turn, but with a card effect, it is possible to attack twice.",
      "battle position and paying costs are not effect activations and",
      "A card is destroyed when it is sent to the Graveyard due to battle",
      "Attacking directly means that a monster attacks a player instead of",
      "attacking a monster. In this case, the damage to the player will be equal",
      "attack directly even if the opponent controls a monster.",
      "Attack Directly",
      "Battle damage is damage inflicted to a player by an attacking monster,",
      "or by a battle between two monsters. This is different from damage from",
      "Battle Damage",
      "A monster “battles” (and is “battling”) starting from when it attacks or",
      "is attacked. This includes both monsters attacking other monsters, and",
      "monsters attacking a player’s Life Points directly. When a card requires a",
      "monster to have “battled” (past tense), the attack had to have reached the",
      "damage calculation portion of the Damage Step in order for the monster to",
      "have “battled”. If the attack stops before damage calculation, the monster",
      "did not “battle”. (Note that an attack was still declared, however, so in",
      "most cases the attacking monster cannot declare another attack.",
      "Battle / Battled",
      "Some monsters can inflict piercing battle damage when they attack a",
      "Defense Position monster. This means that you inflict damage to your",
      "opponent’s LP equal to the difference between the attacking monster’s",
      "Piercing Battle Damage"
    ],
    "damage": {}
  },
  "cardTypes": {},
  "effects": {}
}